{
  "main": {
    "name": "Ethan Ng",
    "occupation": "Software Developer",
    "description": "Currently searching for opportunities in Software Engineering/Development",
    "image": "profilepic.jpg",
    "bio": "I'm at the beginning of my software career and I am excited to collaborate with the best in the industry. I have industry experience in full stack development with the MERN stack and I'm constantly learning new technologies. When I'm not programming, I enjoy playing sports such as Volleyball and Badminton, gaming with some friends, or watching Formula 1. Please feel free to reach out to me if you have any questions!",
    "contactmessage": "Like what you see or have questions for me? Send me an email or reach out to me over phone!",
    "email": "ekyng72@gmail.com",
    "phone": "(403) 894-3868",
    "website": "",
    "resumedownload": "assets/Resume 2021.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/ethan.ng.313",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ethan-ng-16921315b/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/ewyn72",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Some of the skills I've acquired over the years.",
    "education": [
      {
        "school": "Western University",
        "degree": "Bachelor of Engineering Science, Software Engineering Specialization",
        "graduated": "April 2021",
        "description": "Some relevant courses: Object Oriented Design, Database Management Systems, Web technologies."
      }
    ],
    "work": [
      {
        "company": "Amazon",
        "title": "Software Development Engineer Intern",
        "years": "July 2020 - September 2020",
        "description": "I worked on the Tax Service team doing feature development for internal processes. My role was to expose the design of a custom tax data structure to help teams better understand its use cases. I developed a React front-end service to provide greater visibility and maintainability of the tax data structures using a Serverless Application Model by taking advantage of AWS Lambda, DynamoDB, Cognito, and API Gateway as the backend. Full product ownership from design to deployment of service resulting in time savings of approximately 20% by reducing the search time for specific data."
      },
      {
        "company": "ATB Financial",
        "title": "ATB 101 Student - Operations Support",
        "years": "May 2019 - March 2020",
        "description": "Part of the Operations Support team working primarily on process automation to improve internal workflow efficiency. I developed automation tools primarily in Google Script for repetitive workflows in teams by collaborating closely with banking process stakeholders in an agile development environment to define project needs and specifications. The most impactful tool I developed created time savings of up to an hour per person on the process by removing redundant parties involved and automating much of the manual communications."
      }
    ],
    "skillsIndustry": [
      {
        "name": "JavaScript",
        "level": "Expert"
      },
      {
        "name": "Git",
        "level": "Expert"
      },
      {
        "name": "ReactJs",
        "level": "Expert"
      },
      {
        "name": "HTML/CSS",
        "level": "Proficient"
      },
      {
        "name": "AWS",
        "level": "Proficient"
      },
      {
        "name": "Node.js",
        "level": "Proficient"
      }
    ],
    "skillsOthers": [
      {
        "name": "C++",
        "level": "Competent"
      },
      {
        "name": "C#",
        "level": "Competent"
      },
      {
        "name": "Python",
        "level": "Competent"
      },
      {
        "name": "Android",
        "level": "Advanced Beginner"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Contagion Simulator",
        "category": "University capstone project (MVP)",
        "image": "contagion.jpg",
        "url": "https://contagion-simulator-9ce17.web.app/"
      },
      {
        "title": "Web Application - Music Reviews",
        "category": "(Currently down) Web app with major web tech functionality implemented",
        "image": "musicapp.jpg",
        "url": "https://github.com/ewyn72/MusicReview"
      },
      {
        "title": "Realistic Racing Game",
        "category": "Game which simulates physics of a moving vehicle in the unity engine.",
        "image": "rrg.jpg",
        "url": "https://github.com/ewyn72/RacingGame"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      
    ]
  }
}
